### Terraform Plan for Stage 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.app.module.ssr_task.aws_ecs_task_definition.task[0] must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:339713113237:task-definition/digitalekanaler-designmanual:45" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:339713113237:task-definition/digitalekanaler-designmanual" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = []
                  - essential        = true
                  - image            = "637423315721.dkr.ecr.eu-west-1.amazonaws.com/designmanual:8310f68b63a719edf460aa74250090444f7d6357"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "digitalekanaler-designmanual"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "digitalekanaler-designmanual-main"
                        }
                    }
                  - mountPoints      = []
                  - name             = "digitalekanaler-designmanual-main"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "VITE_ENVIRONMENT"
                          - valueFrom = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_ENVIRONMENT"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "digitalekanaler-designmanual" -> (known after apply)
      ~ revision                 = 45 -> (known after apply)
      - tags                     = {} -> null
        # (13 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.data.aws_iam_policy_document.env_ssm_parameters_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "env_ssm_parameters_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:DeleteParameter",
              + "ssm:DescribeParameters",
              + "ssm:GetParameter",
              + "ssm:GetParameters",
              + "ssm:GetParametersByPath",
              + "ssm:PutParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_ENVIRONMENT",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_iam_role_policy.task_execution[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "task_execution" {
        id          = "digitalekanaler-designmanual-task-execution-role:digitalekanaler-designmanual-task-execution-ssm-parameters-policy"
        name        = "digitalekanaler-designmanual-task-execution-ssm-parameters-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:PutParameter",
                          - "ssm:GetParametersByPath",
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                          - "ssm:DeleteParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:eu-west-1:339713113237:parameter/__digitalekanaler-designmanual__/env_vars/VITE_ENVIRONMENT"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_ssm_parameter.environment_vars_to_ssm_parameters["VITE_PUBLIC_SANITY_STUDIO_URL"] will be created
  + resource "aws_ssm_parameter" "environment_vars_to_ssm_parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/__digitalekanaler-designmanual__/env_vars/VITE_PUBLIC_SANITY_STUDIO_URL"
      + region         = "eu-west-1"
      + tags_all       = {
          + "application" = "digitalekanaler-designmanual"
          + "repo"        = "spor"
          + "terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_ssm_parameter.environment_vars_to_ssm_parameters["VITE_SANITY_SECRET"] will be created
  + resource "aws_ssm_parameter" "environment_vars_to_ssm_parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_SECRET"
      + region         = "eu-west-1"
      + tags_all       = {
          + "application" = "digitalekanaler-designmanual"
          + "repo"        = "spor"
          + "terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_ssm_parameter.environment_vars_to_ssm_parameters["VITE_SANITY_STUDIO_URL"] will be created
  + resource "aws_ssm_parameter" "environment_vars_to_ssm_parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_STUDIO_URL"
      + region         = "eu-west-1"
      + tags_all       = {
          + "application" = "digitalekanaler-designmanual"
          + "repo"        = "spor"
          + "terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.app.module.ssr_task.module.env_vars_to_ssm_parameters.aws_ssm_parameter.environment_vars_to_ssm_parameters["VITE_SANITY_TOKEN"] will be created
  + resource "aws_ssm_parameter" "environment_vars_to_ssm_parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_TOKEN"
      + region         = "eu-west-1"
      + tags_all       = {
          + "application" = "digitalekanaler-designmanual"
          + "repo"        = "spor"
          + "terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 5 to add, 1 to change, 1 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit aae3e23dc5245a0ef1ec01e8690338306efd4948*
*Plan generated at: 2025-11-03 14:54:10 UTC*
